simulations/OF12/hydropower/of_interFoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
	//volumetricFlowRate	0.0007142857;
	volumetricFlowRate	0.00001;
	value		uniform (0 0 0);
        //type            flowRateInletVelocity;
        //                massFlowRate
        //                table
        //                (
        //                // time massflowrage kg/s
        //                (0 0)
        //                (0.5 1)
        //                );
	//value		uniform (0 0.00002 0); // fallback only,
    }

    side_wall
    {
        type            noSlip;
    }

    bottom_wall
    {
        type            noSlip;
    }

    top_wall
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    defaultFaces
    {
        type            empty;
    }
}
